OpenFOAM-13/tutorials/multiRegion/film/splashPanel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s fluid blockMesh -region fluid

runApplication extrudeToRegionMesh -region fluid

printf "\n%s\n" "Creating files for paraview post-processing"
paraFoam -touchAll
echo

runApplication foamMultiRun

#------------------------------------------------------------------------------
